## Pandas Hands on

1. Given a sample list, tuple and a set with elements as numbers from 1-10. Convert each
of the data types into a pandas series. Create a separate list of index values for the
series.

In [1]:
import pandas as pd

In [2]:
l = [1,2,3,4,5,6,7,8,9,10]
t = (1,2,3,4,5,6,7,8,9,10)
s = {1,2,3,4,5,6,7,8,9,10}

In [3]:
s1=pd.Series(l, index=['a','b','c','d','e','f','g','h','i','j'])

In [4]:
print(s1)

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [6]:
s2=pd.Series(t, index=['a','b','c','d','e','f','g','h','i','j'])
print(s2)

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [7]:
s3=pd.Series(s, index=['a','b','c','d','e','f','g','h','i','j'])

TypeError: 'set' type is unordered

2. Create a python dictionary with three key value pairs. Keep the keys as the first names,
and the respective last names as values in the dictionary. Use the dictionary to create a
pandas series.

In [8]:
d ={'virat':'kohli','sachin':'tendulkar','rohit':'sharma'}

In [9]:
s=pd.Series(d)

In [10]:
print(s)

virat         kohli
sachin    tendulkar
rohit        sharma
dtype: object

3. Create a pandas series, with the elements as numbers from 1-10. Use the index values
starting from 0-10. For the above series:

a. Convert it to a list.

b. Convert it to a dictionary.

c. Convert it to a tuple.

d. Convert it to a set.

In [11]:
s=pd.Series(range(1,11))
print(s)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [12]:
# a

lst = list(s)
print(lst)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [13]:
d = dict(s)
print(d)

{0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10}

In [15]:
t = tuple(s)
print(t)

(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

In [16]:
st = set(s)
print(st)

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

4. Create a sample pandas series with x integer elements. Perform the following operations
on the same:

a. Print the first 5 elements of the series

b. Print the last 5 elements of the series

c. Insert an integer value ‘50’ at the index 5.

d. Update the last element in the series with the value 100.

e. Delete the first element from the series.

Note: The index values must not be affected by the operations and should be uniform for
the series after the last operation.

In [40]:
s = pd.Series(range(1,11))
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [41]:
# a

s.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [42]:
s[:5]

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [43]:
# b

s.tail()

5     6
6     7
7     8
8     9
9    10
dtype: int64

In [44]:
s[5:]

5     6
6     7
7     8
8     9
9    10
dtype: int64

In [45]:
# c

s[5]=50

In [46]:
print(s)

0     1
1     2
2     3
3     4
4     5
5    50
6     7
7     8
8     9
9    10
dtype: int64

In [47]:
# d

s[-1:]=100

In [48]:
print(s)

0      1
1      2
2      3
3      4
4      5
5     50
6      7
7      8
8      9
9    100
dtype: int64

In [49]:
s.drop(0, inplace=True)

In [50]:
print(s)

1      2
2      3
3      4
4      5
5     50
6      7
7      8
8      9
9    100
dtype: int64

In [51]:
s=s.reset_index(drop=True)

In [52]:
print(s)

0      2
1      3
2      4
3      5
4     50
5      7
6      8
7      9
8    100
dtype: int64

5. For a given pandas series obtained in the 4th step. Write a sample code to find the
element 100 in the series.

In [53]:
s

0      2
1      3
2      4
3      5
4     50
5      7
6      8
7      9
8    100
dtype: int64

In [58]:
def find(n):
    
    for i in range(len(s)):
        if s.iloc[i]== n:
            return i

In [59]:
index=find(100)

print('100 is present at index ',index)

100 is present at index  8

6. For the given series A and B, perform concatenation on the same.

series_A = pd.Series([1,2,3,4,5])

series_B = pd.Series([6,7,8,9,10])

In [60]:
series_A = pd.Series([1,2,3,4,5])

series_B = pd.Series([6,7,8,9,10])

In [61]:
series_A

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [62]:
series_B

0     6
1     7
2     8
3     9
4    10
dtype: int64

In [64]:
series_c = pd.concat([series_A,series_B])

In [65]:
series_c

0     1
1     2
2     3
3     4
4     5
0     6
1     7
2     8
3     9
4    10
dtype: int64

In [66]:
series_c.reset_index(drop=True,inplace=True)

In [67]:
series_c

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

7. Using loops in python, print all the elements within a pandas series.

Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

In [68]:
Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

In [69]:
for i in Sample:
    print(i)

1
2
3
4
5
6
7
8
9
10

8. For a given nested list and a sample dictionary, create two data frames using pandas.

List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]

Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

In [70]:
List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]

Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

In [71]:
df1 = pd.DataFrame(List)
df2 = pd.DataFrame(Dictionary)

In [72]:
df1

    0   1   2
0  AA  BB  CC
1  DD  EE  FF
2  GG  HH  II

In [73]:
df2

     Kris Memphis
0  Jordan   Depay
1      12      23
2      22      24

In [74]:
d = {'Name':['sachin','virat','rohit'],'Age':[45,38,36]}

df3 = pd.DataFrame(d)
df3

     Name  Age
0  sachin   45
1   virat   38
2   rohit   36

9. Create a pandas Dataframe with two columns = [‘Name’, ‘Age’]. Perform the following
operations on the same.

a. Print the first 3 rows of the Data Frame.

b. Print the rows that have the age greater than 15.

c. Insert 5 imaginary names and ages as values to the pandas Data Frame.

d. Update the 5th row so that the name = john and age=56.

e. Delete the first row from the Data Frame .

In [77]:
d = {'Name':['sachin','virat','rohit','ajinkya'],'Age':[45,38,36,34]}
df=pd.DataFrame(d)

In [78]:
df

      Name  Age
0   sachin   45
1    virat   38
2    rohit   36
3  ajinkya   34

In [79]:
# a

df.head(3)

     Name  Age
0  sachin   45
1   virat   38
2   rohit   36

In [80]:
# b

df[df.Age > 15]

      Name  Age
0   sachin   45
1    virat   38
2    rohit   36
3  ajinkya   34

In [81]:
df.loc[4]=['a',14]   # <- one-by-one

In [82]:
df

      Name  Age
0   sachin   45
1    virat   38
2    rohit   36
3  ajinkya   34
4        a   14

In [83]:
d={'Name':['b','c','d'], 'Age':[15,16,17]}  # <- by creating a new dataframe and then merging it
df1=pd.DataFrame(d)
df1

  Name  Age
0    b   15
1    c   16
2    d   17

In [85]:
df=pd.concat([df,df1])

In [86]:
df

      Name  Age
0   sachin   45
1    virat   38
2    rohit   36
3  ajinkya   34
4        a   14
0        b   15
1        c   16
2        d   17

In [88]:
df.reset_index(drop=True,inplace=True)

In [89]:
df

      Name  Age
0   sachin   45
1    virat   38
2    rohit   36
3  ajinkya   34
4        a   14
5        b   15
6        c   16
7        d   17

In [93]:
# d

df.loc[4]=['John',56]

In [94]:
df

      Name  Age
0   sachin   45
1    virat   38
2    rohit   36
3  ajinkya   34
4     John   56
5        b   15
6        c   16
7        d   17

In [97]:
# e

df.drop(0, inplace=True)

In [98]:
df

      Name  Age
1    virat   38
2    rohit   36
3  ajinkya   34
4     John   56
5        b   15
6        c   16
7        d   17

In [99]:
df.reset_index(drop=True,inplace=True)

In [100]:
df

      Name  Age
0    virat   38
1    rohit   36
2  ajinkya   34
3     John   56
4        b   15
5        c   16
6        d   17

10. For the Data Frame obtained from step 9, convert the same to a list and a dictionary
respectively.

In [101]:
l=list(df)

d=dict(df)

In [102]:
l

['Name', 'Age']

In [104]:
print(d)

{'Name': 0      virat
1      rohit
2    ajinkya
3       John
4          b
5          c
6          d
Name: Name, dtype: object, 'Age': 0    38
1    36
2    34
3    56
4    15
5    16
6    17
Name: Age, dtype: int64}

In [106]:
list(df.values)

[array(['virat', 38], dtype=object),
 array(['rohit', 36], dtype=object),
 array(['ajinkya', 34], dtype=object),
 array(['John', 56], dtype=object),
 array(['b', 15], dtype=object),
 array(['c', 16], dtype=object),
 array(['d', 17], dtype=object)]

In [107]:
dict(df.values)

{'virat': 38,
 'rohit': 36,
 'ajinkya': 34,
 'John': 56,
 'b': 15,
 'c': 16,
 'd': 17}

11. Create two separate Data Frames A and B, and perform the following operations on
them.

a. Concatenate the two Data Frame s to a new Data Frame C.

b. Split the Data Frame C row wise.

c. Split the Data Frame column wise based on a condition. For example - columns
values greater than 10, column values less than 10, etc

In [111]:
A=pd.DataFrame(range(10,51,10), columns=['A'])

B=pd.DataFrame(range(60,101,10), columns=['B'])

In [112]:
A

    A
0  10
1  20
2  30
3  40
4  50

In [113]:
B

     B
0   60
1   70
2   80
3   90
4  100

In [115]:
# a

C = pd.concat([A,B], axis=1)
print(C)

    A    B
0  10   60
1  20   70
2  30   80
3  40   90
4  50  100

In [117]:
# b 

C_split=C.head(3)

In [118]:
C_split

    A   B
0  10  60
1  20  70
2  30  80

In [119]:
# c

C[C['B']>70]

    A    B
2  30   80
3  40   90
4  50  100

12. Create a Data Frame with columns Name and Age. Perform the following operations.

a. Write a sample code to search for the Name/Names where Age is 20.

b. Sort the Data Frame in ascending order of ages.

c. Using Python loops, print the ages from the data frame and store it in a set.

In [120]:
d = {'Name':['sachin','virat','rohit','ajinkya'],'Age':[45,38,36,34]}
df=pd.DataFrame(d)

In [121]:
df

      Name  Age
0   sachin   45
1    virat   38
2    rohit   36
3  ajinkya   34

In [122]:
# a

df[df['Age']==20]

Empty DataFrame
Columns: [Name, Age]
Index: []

In [123]:
# b

df.sort_values(by='Age')

      Name  Age
3  ajinkya   34
2    rohit   36
1    virat   38
0   sachin   45

In [127]:
# c

l=[]

for i in df['Age']:
    l.append(i)
    
    
s=set(l)
print(s)

{34, 36, 45, 38}